What Is DataFrames :

When You Combine Multiple Series Togther its become DataFrame.

In [4]:
import numpy as np
import pandas as pd

Creating a DataFrame

You can create dataframes with list and dict

In [11]:
data = {
    'Name': ['Any', 'Ava', 'Pratap', 'Sahil'],
    'Age': [20, 24, 34, 21],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 55000, 670000, 860000]
}
pd.DataFrame(data)

     Name  Age      City  Salary
0     Any   20  New York   65000
1     Ava   24     Paris   55000
2  Pratap   34    Berlin  670000
3   Sahil   21    London  860000

In [12]:
data_list = [
    ['Anny', 20, 'New York', 65000 ],
    ['Ava', 24, 'Paris', 55000],
    ['Pratap',34, 'Berlin', 670000],
    ['Sahil', 21 , 'London', 860000]
]
df2=pd.DataFrame(data_list)
columns=["Name", "Age", "City", "Salary"]
df2=pd.DataFrame(data_list,columns=columns)
df2

     Name  Age      City  Salary
0    Anny   20  New York   65000
1     Ava   24     Paris   55000
2  Pratap   34    Berlin  670000
3   Sahil   21    London  860000

In [13]:
df2

     Name  Age      City  Salary
0    Anny   20  New York   65000
1     Ava   24     Paris   55000
2  Pratap   34    Berlin  670000
3   Sahil   21    London  860000

Selection and Indexing of Columns

In [14]:
df2

     Name  Age      City  Salary
0    Anny   20  New York   65000
1     Ava   24     Paris   55000
2  Pratap   34    Berlin  670000
3   Sahil   21    London  860000

In [16]:
df2['Name']

0      Anny
1       Ava
2    Pratap
3     Sahil
Name: Name, dtype: object

In [17]:
df2['City']

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: object

In [19]:
df2[['Name', 'City']]

     Name      City
0    Anny  New York
1     Ava     Paris
2  Pratap    Berlin
3   Sahil    London

Creating a new column

In [20]:
df2["Designation"] = ["Doctor", "Eng.","Doctor","Eng."]

In [21]:
df2

     Name  Age      City  Salary Designation
0    Anny   20  New York   65000      Doctor
1     Ava   24     Paris   55000        Eng.
2  Pratap   34    Berlin  670000      Doctor
3   Sahil   21    London  860000        Eng.

Removing Columns

In [26]:
df2.drop('Designation',axis = 1, inplace = True)

In [27]:
df2

     Name  Age      City  Salary
0    Anny   20  New York   65000
1     Ava   24     Paris   55000
2  Pratap   34    Berlin  670000
3   Sahil   21    London  860000

In [28]:
df2.drop(0,axis = 0)

     Name  Age    City  Salary
1     Ava   24   Paris   55000
2  Pratap   34  Berlin  670000
3   Sahil   21  London  860000

Selecting Rows

In [29]:
df2

     Name  Age      City  Salary
0    Anny   20  New York   65000
1     Ava   24     Paris   55000
2  Pratap   34    Berlin  670000
3   Sahil   21    London  860000

In [32]:
df2.loc[[0,1]]

   Name  Age      City  Salary
0  Anny   20  New York   65000
1   Ava   24     Paris   55000

In [37]:
df2.iloc[3]

Name       Sahil
Age           21
City      London
Salary    860000
Name: 3, dtype: object

Selecting Subsets of Rows and Columns

In [40]:
df2.loc[[0,1]][['City','Salary']]

       City  Salary
0  New York   65000
1     Paris   55000

Conditional Selection

In [41]:
df2

     Name  Age      City  Salary
0    Anny   20  New York   65000
1     Ava   24     Paris   55000
2  Pratap   34    Berlin  670000
3   Sahil   21    London  860000

In [42]:
# People whose age is above 30

In [43]:
df2[df2['Age']>30]

     Name  Age    City  Salary
2  Pratap   34  Berlin  670000

In [44]:
# People whose age is above 30 and their city must be pairs

In [46]:
df2[(df2["Age"]>30) & (df2["City"]=='Berlin')]

     Name  Age    City  Salary
2  Pratap   34  Berlin  670000